app/Controllers/Api/ApiController.php

INSERT INTO `tbl_user` (`user_first_name`, `user_last_name`, `user_email_address`, `user_mobile_number`, `user_password`) VALUES ('Hitesh', 'Prajapati', 'hitesh.wp1@gmail.com', '9904613123', '90f1964311d03fd6edac03da1adf4a66ee2b30c062ac18ebf3d5d5972a2f6734602d2ecde03c39de03a03054f7a71cf4f300879174c083e05c86d4e2cbc9e01dEBzK7Aq56nCKIus0hlQsksLI6yVv4l/ut7C2lA==')
---
    public function user_registration()
    {
        $encrypter = \Config\Services::encrypter();
        $rules = [
            "first_name"    => "required",
            "last_name"     => "required",
            "email_address" => "required|valid_email|is_unique[tbl_user.user_email_address]",
            "mobile_number" => "required",
            "password"      => "required",
        ];

        if( ! $this->validate($rules) )
        {
            $response = [
                "status"    =>  false,
                "message"   =>  $this->validator->getErrors(),
                "data"      =>  []
            ];
        }
        else
        {
            $user_model_data = new UserModel();
            $data = [
                "user_first_name"       =>  $this->request->getVar("first_name"),
                "user_last_name"        =>  $this->request->getVar("last_name"),
                "user_email_address"    =>  $this->request->getVar("email_address"),
                "user_mobile_number"    =>  $this->request->getVar("mobile_number"),
                "user_password"         =>  $encrypter->encrypt($this->request->getVar("password")),
            ];

            if( $user_model_data->insert($data) )

SELECT *
FROM `tbl_user`
WHERE `user_email_address` = 'hitesh.wp@gmail.com'
AND `user_status` != '0'
 LIMIT 1
---
    public function forgot_password()
    {
        $rules = [
            "email_address" => "required|valid_email",
        ];

        if( ! $this->validate($rules) )
        {
            $response = [
                "status"    =>  false,
                "message"   =>  $this->validator->getErrors(),
                "data"      =>  []
            ];
        }
        else
        {
            $userModel = new UserModel();
            $loginData = $userModel->where("user_email_address", trim($this->request->getVar("email_address")))
                                    ->where("user_status!=", "0")
                                    ->first();

UPDATE `tbl_user` SET `user_status` = '5'
WHERE `tbl_user`.`user_id` IN ('1')
---
                $email->setSubject('Reset Password - '.SITE_TITLE);
                $email->setMessage($html);

                if( $userModel->update($loginData["user_id"], $updated_data) )