app/Controllers/Api/ApiController.php

    public function user_login()
    {
        $encrypter = \Config\Services::encrypter();
        $rules = [
            "mobile_number" => "required",
            "password"      => "required",
        ];

        if( ! $this->validate($rules) )
        {
            $response = [
                "status"    =>  false,
                "message"   =>  $this->validator->getErrors(),
            ];
        }
        else
        {
            $userModel = new UserModel();
            $loginData = $userModel->where("user_mobile_number", trim($this->request->getVar("mobile_number")))
                                    ->where("user_status != ", "0")
                                    ->first();
            if( $loginData )
            {
                if( trim($this->request->getVar("password")) == $encrypter->decrypt($loginData["user_password"]) )
                {
                    $token = $this->get_token();
                    $update_data = array(
                        "user_login_token"  => $token,
                    );
                    if( $userModel->update($loginData["user_id"],$update_data) )
                    {
                        $getUserData = $userModel->where("user_id", trim($loginData["user_id"]))
                                                ->first();
---
SELECT *
FROM `tbl_user`
WHERE `user_mobile_number` = '9904613123'
AND `user_status` != '0'
 LIMIT 1
UPDATE `tbl_user` SET `user_login_token` = 'umUpTFGnkAigUqdba!@#gMcdUNgiUBheKPKYRKuoA!TGEqm'
WHERE `tbl_user`.`user_id` IN ('1')
SELECT *
FROM `tbl_user`
WHERE `user_id` = '1'
 LIMIT 1

    public function forgot_password()
    {
        $rules = [
            "mobile_number" => "required",
        ];

        if( ! $this->validate($rules) )
        {
            $response = [
                "status"    =>  false,
                "message"   =>  $this->validator->getErrors(),
            ];
        }
        else
        {
            $userModel = new UserModel();
            $loginData = $userModel->where("user_mobile_number", trim($this->request->getVar("mobile_number")))
                                    ->where("user_status!=", "0")
                                    ->first();
            if( $loginData )
            {
                $updated_data = array(
                    "user_status"   => "5"
                );

                if( $userModel->update($loginData["user_id"], $updated_data) )
                {
                    $getUserData = $userModel->where("user_id", trim($loginData["user_id"]))
                                                ->first();
---
UPDATE `tbl_user` SET `user_password` = '84e7795e43b914a7df54a16bf65c6e6a4090d7d58bbb3a95e88e359dcd08274e56fb036dde067af2a1e713693604fd8e756bbcae0f9d6b2541eea6ecdb2e3199X0pDWYI7O7OD6K6xN4pCcC5eEq3nHg=='
WHERE `tbl_user`.`user_id` IN ('1')
SELECT *
FROM `tbl_user`
WHERE `user_id` = '1'
AND `user_status` = '5'
 LIMIT 1

    public function edit_profile()
    {
        // echo "<pre>"; print_r($this->request->getFile("user_image"));
        // print_r($this->request->getVar()); die;
        $rules = [
            "user_id"      => "required",
            "full_name"    => "required",
        ];

        if( $this->request->getFile("user_image") )
        {
            $rules["user_image"] = "max_size[user_image,1024]|is_image[user_image]|mime_in[user_image,image/png,image/jpeg]";
        }

        if( ! $this->validate($rules) )
        {
            $response = [
                "status"    =>  false,
                "message"   =>  $this->validator->getErrors(),
            ];
        }
        else
        {
            $userModel = new UserModel();
            $checkUserData = $userModel->where("user_id", trim($this->request->getVar("user_id")))
                                    ->first();
---
SELECT *
FROM `tbl_user`
WHERE `user_id` = '1'
 LIMIT 1

    public function change_password()
    {
        $encrypter = \Config\Services::encrypter();
        $rules = [
            "user_id"       => "required",
            "new_password"  => "required",
        ];

        if( ! $this->validate($rules) )
        {
            $response = [
                "status"    =>  false,
                "message"   =>  $this->validator->getErrors(),
            ];
        }
        else
        {
            $userModel = new UserModel();
            $loginData = $userModel->where("user_id", trim($this->request->getVar("user_id")))
                                    ->where("user_status", "1")
                                    ->first();
            if( $loginData )
            {
                $updated_data = array(
                    "user_password"  =>  $encrypter->encrypt($this->request->getVar("new_password")),
                    "user_status"   => "1"
                );

                if( $userModel->update($loginData["user_id"], $updated_data) )
---
SELECT *
FROM `tbl_user`
WHERE `user_id` = '1'
AND `user_status` = '1'
 LIMIT 1
UPDATE `tbl_user` SET `user_password` = 'c7cf2783d5af61db3fdb1ce6f6c48223e501dc59a70ec6a4fe01359b629eac55e676ccb5f31b8f52b7366c2b76abb68859b2df90e70038c136c4f19248c9f628YBNJ1hXXHSNX0QBhhFacnkoP5Xpk+53hMw1Ouw==', `user_status` = '1'
WHERE `tbl_user`.`user_id` IN ('1')