app/Controllers/Api/ApiController.php

    public function user_login()
    {
        $encrypter = \Config\Services::encrypter();
        $rules = [
            "mobile_number" => "required",
            "password"      => "required",
        ];

        if( ! $this->validate($rules) )
        {
            $response = [
                "status"    =>  false,
                "message"   =>  $this->validator->getErrors(),
                "data"      =>  []
            ];
        }
        else
        {
            $userModel = new UserModel();
            $loginData = $userModel->where("user_mobile_number", trim($this->request->getVar("mobile_number")))
                                    ->where("user_status", "1")
                                    ->first();
---
SELECT *
FROM `tbl_user`
WHERE `user_mobile_number` = '9904613123'
AND `user_status` = '1'
 LIMIT 1

    public function forgot_password()
    {
        $rules = [
            "mobile_number" => "required",
        ];

        if( ! $this->validate($rules) )
        {
            $response = [
                "status"    =>  false,
                "message"   =>  $this->validator->getErrors(),
                "data"      =>  []
            ];
        }
        else
        {
            $userModel = new UserModel();
            $loginData = $userModel->where("user_mobile_number", trim($this->request->getVar("mobile_number")))
                                    ->where("user_status!=", "0")
                                    ->first();
---
SELECT *
FROM `tbl_user`
WHERE `user_mobile_number` = '9904613123'
AND `user_status` != '0'
 LIMIT 1