app/Controllers/LoginController.php

    public function reset_password()
    {
        if( $this->request->getGet() && $this->request->getGet("rp") )
        {
            $userModel = new UserModel();
            $query_string = base64_decode($this->request->getGet("rp"));
            $query_string = json_decode($query_string, true);
            if( isset($query_string["email_address"]) )
            {
                $userData = $userModel->where("user_email_address", trim($query_string["email_address"]))
                                        ->where("user_status", "5")
                                        ->first();
---
SELECT *
FROM `tbl_user`
WHERE `user_email_address` = 'hitesh.wp@gmail.com'
AND `user_status` = '5'
 LIMIT 1