app/Controllers/UserController.php

            }
        }

        $userModelTotalData = $userModel->where("user_status", "1")
                                        ->findAll();
        $userModelData      = $userModel->where("user_status", "1")
                                        ->orderBy($order, $orderBy)
                                        ->findAll($rowperpage, $start);
---
SELECT *
FROM `tbl_user`
WHERE `user_status` != '0'
SELECT *
FROM `tbl_user`
WHERE `user_status` != '0'
ORDER BY `tbl_user`.`user_id` DESC
 LIMIT 10

    public function create()
    {
        $country_model = new CountryModel();
        $country_model_data = $country_model->orderBy('country_name','asc')->findAll();
---
SELECT *
FROM `tbl_countries`
ORDER BY `country_name` ASC

    public function store_user_data()
    {
        $request   = service('request');
        $postData  = $request->getPost();
        $user_model = new UserModel();

        if( $postData["action_type"] == "act_store_user_data")
        {
            $userModelCheck = $user_model->where("user_mobile_number", $postData["txtphonenumber"])
                                            ->first();
            if($userModelCheck)
            {
                $data = array(
                    "status"    => "Failed",
                    "message"   => "Enter unique mobile number!",
                );
            }
            else
            {
                $insertdata = array(
                        'user_type'                         =>  $postData["txtusertype"],
                        'user_full_name'                    =>  $postData["txtuserfullname"],
                        'user_mobile_number'                =>  $postData["txtphonenumber"],
                        'user_referral_by'                  =>  $postData["txtreferralby"],
                        'created_at'                        =>  date("Y-m-d H:i:s"),
                        'user_status'                       =>  $postData["txtstatus"],
                );

                if($user_model->insert($insertdata))
---
SELECT *
FROM `tbl_user`
WHERE `user_mobile_number` = '1234567890'
 LIMIT 1
INSERT INTO `tbl_user` (`user_type`, `user_full_name`, `user_mobile_number`, `user_referral_by`, `user_password`, `created_at`, `user_status`) VALUES ('1', 'Test', '1234567890', 'By', '8040694e2976c60e421c65866a7be5f2a4dc44870fd7305dcf79296e0453dccbe8567010b06d34de0f0178b5d89dcb247813c4ee9988df57dcdb500d9f30be2fhZMUeAJhPPmkO3Zs5rJo4Q==', '2024-06-06 16:54:23', '1')

    public function update_user_data()
    {
        $request   = service('request');
        $postData  = $request->getPost();
        $user_model = new UserModel();
        $update_user_id = $postData["update_user_id"];

        if( $postData["action_type"] == "act_update_user_data")
        {
            $userModelCheck = $user_model->where("user_mobile_number", $postData["txtphonenumber"])
                                            ->where("user_id !=", $update_user_id)
                                            ->first();
            if($userModelCheck)
            {
                $data = array(
                    "status"    => "Failed",
                    "message"   => "Enter unique mobile number!",
                );
            }
            else
            {
                $updatedata = array(
                        'user_type'                         =>  $postData["txtusertype"],
                        'user_full_name'                    =>  $postData["txtuserfullname"],
                        'user_mobile_number'                =>  $postData["txtphonenumber"],
                        'user_referral_by'                  =>  $postData["txtreferralby"],
                        'updated_at'                        =>  date("Y-m-d H:i:s"),
                        'user_status'                       =>  $postData["txtstatus"],
                );

                if($user_model->update($update_user_id, $updatedata))
---
SELECT *
FROM `tbl_user`
WHERE `user_mobile_number` = '1234567890'
AND `user_id` != '8'
 LIMIT 1
UPDATE `tbl_user` SET `user_type` = '1', `user_full_name` = 'Test', `user_mobile_number` = '1234567890', `user_referral_by` = 'By', `updated_at` = '2024-06-07 05:51:33', `user_status` = '4'
WHERE `tbl_user`.`user_id` IN ('8')

    public function delete_user_data()
    {
        $request   = service('request');
        $postData  = $request->getPost();
        $user_model = new UserModel();

        if( isset($postData["action_type"]) && isset($postData["deleteuserid"]) && $postData["action_type"] == "act_delete_user_data" )
        {
            $requestDeleteId = $postData["deleteuserid"];
            $userModelCheck = $user_model->where("user_id",$requestDeleteId)
                                            ->first();
            if(!$userModelCheck)
            {
                $data = array(
                    "status"    => "failed",
                    "message"   => "Invalid user id!",
                );
            }

            $updatedata = [
                'deleted_at'                    =>  date("Y-m-d H:i:s"),
                'user_status'                =>  "2",
            ];

            if($user_model->update($requestDeleteId, $updatedata))
---
UPDATE `tbl_user` SET `user_type` = '2', `user_shop_name` = 'Test Shop Name', `user_country_id` = '101', `user_state_id` = '12', `user_city_id` = '1003', `user_pincode` = '384265', `user_address` = 'Test address', `user_first_name` = 'Hitesh', `user_last_name` = 'Prajapati', `user_email_address` = 'hitesh.wp@gmail.com', `user_mobile_number` = '9898989898', `user_alternative_mobile_number` = '9856585658', `user_wallet_cap` = '1000', `user_company_name` = 'Test Comany', `user_pan_card` = 'SASA09709D', `user_aadhar_card` = '585685658565', `user_gst_number` = 'GH2342423', `user_rights` = 'Payment Revert,Referral Status', `user_referral_by` = '8989898989', `created_at` = '2024-05-24 09:49:22', `updated_at` = '2024-05-24 09:49:22', `user_status` = '1'
WHERE `tbl_user`.`user_id` IN ('1')

            }
        }

        $userModelTotalData = $userModel->where("user_status", "0")
                                        ->findAll();
        $userModelData      = $userModel->where("user_status", "0")
                                        ->orderBy($order, $orderBy)
                                        ->findAll($rowperpage, $start);
---
SELECT *
FROM `tbl_user`
WHERE `user_status` = '0'
SELECT *
FROM `tbl_user`
WHERE `user_status` = '0'
ORDER BY `tbl_user`.`user_id` DESC
 LIMIT 10